other_files/OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    //#include "fixedInlet"
	#include "ABLConditions"


inlet{
 
	type atmBoundaryLayerInletVelocity;
	/*n 		(1 0 0);
	z 		1.0;
	kappa 		0.41;
	Uref 		1.0;
	Href 		0.0;
	z0 		uniform 0.0;
	zGround 	uniform 0.0;*/
	       
        #include        "ABLConditions"
}

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Envelope_1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }



    #include "frontBackUpperPatches"
}

// ************************************************************************* //
